tap "dracula/install"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "spring-io/tap"
tap "stripe/stripe-cli"
brew "openssl@3"
brew "sqlite"
brew "python@3.12"
brew "azure-cli"
brew "bash"
brew "python@3.13"
brew "glib"
brew "icu4c@76"
brew "harfbuzz"
brew "bazel"
brew "black"
brew "boost"
brew "llvm"
brew "ccls"
brew "ruby"
brew "cocoapods"
brew "php"
brew "composer"
brew "node"
brew "emscripten"
brew "eza"
brew "fetch"
brew "firebase-cli"
brew "fish"
brew "flake8"
brew "fribidi"
brew "fzf"
brew "gcc@11"
brew "gh"
brew "libarchive"
brew "git"
brew "git-lfs"
brew "go"
brew "gradle"
brew "graphviz"
brew "gsl"
brew "imagemagick"
brew "ipython"
brew "jpeg"
brew "jq"
brew "libmemcached"
brew "libsixel"
brew "libxml2"
brew "llvm@16"
brew "lsix"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "maven"
brew "mongodb-atlas-cli"
brew "neofetch"
brew "tree-sitter", args: ["HEAD"]
brew "neovim"
brew "numpy"
brew "pkgconf"
brew "pnpm"
brew "portaudio"
brew "pydocstyle"
brew "pylint"
brew "python-lsp-server"
brew "python@3.11"
brew "ripgrep"
brew "rust"
brew "scala"
brew "sdl12-compat"
brew "spicetify-cli", link: false
brew "utf8proc", args: ["HEAD"]
brew "tmux"
brew "tpm"
brew "tree"
brew "vim"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "spring-io/tap/spring-boot"
brew "stripe/stripe-cli/stripe"
cask "db-browser-for-sqlite"
cask "docker"
cask "dotnet-sdk"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "rectangle"
cask "sf-symbols"
cask "temurin"
cask "wezterm"
cask "xquartz"
