tap "dracula/install"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "spring-io/tap"
tap "stripe/stripe-cli"
brew "openssl@3"
brew "python@3.12"
brew "azure-cli"
brew "bash"
brew "glib"
brew "harfbuzz"
brew "icu4c@76"
brew "python@3.13"
brew "bazel"
brew "black"
brew "boost"
brew "llvm"
brew "ccls"
brew "cocoapods"
brew "php"
brew "composer"
brew "node"
brew "emscripten"
brew "eza"
brew "fetch"
brew "firebase-cli"
brew "fish"
brew "fribidi"
brew "fzf"
brew "gcc@11"
brew "gh"
brew "libarchive"
brew "git"
brew "git-lfs"
brew "go"
brew "gradle"
brew "graphviz"
brew "gsl"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "libmemcached"
brew "libxml2"
brew "llvm@16"
brew "lsix"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "maven"
brew "mongodb-atlas-cli"
brew "zlib"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "numpy"
brew "pkgconf"
brew "pnpm"
brew "python@3.11"
brew "redis"
brew "ripgrep"
brew "rust"
brew "scala"
brew "sdl12-compat"
brew "utf8proc", args: ["HEAD"]
brew "tmux"
brew "tpm"
brew "tree"
brew "uv"
brew "vim"
brew "yarn"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"
brew "spring-io/tap/spring-boot"
brew "stripe/stripe-cli/stripe"
cask "docker"
cask "flutter"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "rectangle"
cask "sf-symbols"
cask "temurin"
cask "wezterm"
cask "xquartz"
vscode "aaron-bond.better-comments"
vscode "alexisvt.flutter-snippets"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hzgood.dart-data-class-generator"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "nucllear.vscode-extension-auto-import"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "sidthesloth.html5-boilerplate"
vscode "steoates.autoimport"
vscode "tal7aouy.rainbow-bracket"
vscode "twxs.cmake"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
